#include "max7219.h"

uint8_t aTxBuf[1]={0};
extern SPI_HandleTypeDef hspi3;
char dg=8;
uint8_t eye_speed = 20; //Eye animation speed

#define cs_set() HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_RESET)
#define cs_reset() HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET)

void Send_7219 (uint8_t rg, uint8_t dt)
{
	cs_set();
	aTxBuf[0]=rg;
	HAL_SPI_Transmit (&hspi3, (uint8_t*)aTxBuf, 1, 5000);
	aTxBuf[0]=dt;
	HAL_SPI_Transmit (&hspi3, (uint8_t*)aTxBuf, 1, 5000);
	cs_reset();
}
//------------------------------------------------------
void Clear_7219 (void)
{
	uint8_t i=dg;
	do
	{
          Send_7219(i,0x0);//символ пустоты
	} while (--i);
}
//------------------------------------------------------
void Number_7219 (volatile long n)
{
	uint8_t ng=0;//переменная для минуса
	if(n<0)
	{
          ng=1;
          n*=-1;
	}
	uint8_t i=1;
	do
	{
          Send_7219(++i,n%10);//символ цифры
          n/=10;
	} while(n);
	if(ng)
	{
          Send_7219(i+1,0x0A);//символ -
	}
}
//-------------------------------------------------------
void Init_7219 (void)
{
  Send_7219(0x09,0x00);//включим режим декодирования
  Send_7219(0x0B,0x07);//кол-во используемых разрядов
  Send_7219(0x0A,0x01);//интенсивность свечения
  Send_7219(0x0C,0x01);//включим индикатор
  Clear_7219();
}

void eye_standby(void)
{
		//Blinking eye animation
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x3C);//	00111100
		Send_7219(0x03,0x7E);//	01111110
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x7E);//	01111110
		Send_7219(0x07,0x3C);//	00111100
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x00);//	00000000
		Send_7219(0x03,0x7E);//	01111110
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x7E);//	01111110
		Send_7219(0x07,0x00);//	00000000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x00);//	00000000
		Send_7219(0x03,0x00);//	00000000
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x00);//	00000000
		Send_7219(0x07,0x00);//	00000000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x00);//	00000000
		Send_7219(0x03,0x00);//	00000000
		Send_7219(0x04,0x00);//	00000000
		Send_7219(0x05,0x00);//	00000000
		Send_7219(0x06,0x00);//	00000000
		Send_7219(0x07,0x00);//	00000000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x00);//	00000000
		Send_7219(0x03,0x00);//	00000000
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x00);//	00000000
		Send_7219(0x07,0x00);//	00000000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x00);//	00000000
		Send_7219(0x03,0x7E);//	01111110
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x7E);//	01111110
		Send_7219(0x07,0x00);//	00000000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x3C);//	00111100
		Send_7219(0x03,0x7E);//	01111110
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x7E);//	01111110
		Send_7219(0x07,0x3C);//	00111100
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(2000);
}
void eye_move_left(void)
{
		//Moving eye to left
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x78);//	01111000
		Send_7219(0x03,0x7C);//	11111100
		Send_7219(0x04,0x7C);//	11111100
		Send_7219(0x05,0x7C);//	11111100
		Send_7219(0x06,0x7C);//	11111100
		Send_7219(0x07,0x78);//	01111000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0xF0);//	11110000
		Send_7219(0x03,0xF8);//	11111000
		Send_7219(0x04,0xF8);//	11111000
		Send_7219(0x05,0xF8);//	11111000
		Send_7219(0x06,0xF8);//	11111000
		Send_7219(0x07,0xF0);//	11111000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0xE0);//	11100000
		Send_7219(0x03,0xF0);//	11110000
		Send_7219(0x04,0xF0);//	11110000
		Send_7219(0x05,0xF0);//	11110000
		Send_7219(0x06,0xF0);//	11110000
		Send_7219(0x07,0xE0);//	11100000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0xC0);//	11000000
		Send_7219(0x03,0xE0);//	11100000
		Send_7219(0x04,0xE0);//	11100000
		Send_7219(0x05,0xE0);//	11100000
		Send_7219(0x06,0xE0);//	11100000
		Send_7219(0x07,0xC0);//	11000000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(1000);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0xE0);//	11100000
		Send_7219(0x03,0xF0);//	11110000
		Send_7219(0x04,0xF0);//	11110000
		Send_7219(0x05,0xF0);//	11110000
		Send_7219(0x06,0xF0);//	11110000
		Send_7219(0x07,0xE0);//	11100000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0xF0);//	11110000
		Send_7219(0x03,0xF8);//	11111000
		Send_7219(0x04,0xF8);//	11111000
		Send_7219(0x05,0xF8);//	11111000
		Send_7219(0x06,0xF8);//	11111000
		Send_7219(0x07,0xF0);//	11111000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x78);//	01111000
		Send_7219(0x03,0x7C);//	11111100
		Send_7219(0x04,0x7C);//	11111100
		Send_7219(0x05,0x7C);//	11111100
		Send_7219(0x06,0x7C);//	11111100
		Send_7219(0x07,0x78);//	01111000
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x3C);//	00111100
		Send_7219(0x03,0x7E);//	01111110
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x7E);//	01111110
		Send_7219(0x07,0x3C);//	00111100
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
}
void eye_move_right(void)
{
		//Moving eye to right
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x1F);//	00011111
		Send_7219(0x03,0x3F);// 00111111
		Send_7219(0x04,0x3F);//	00111111
		Send_7219(0x05,0x3F);//	00111111
		Send_7219(0x06,0x3F);//	00111111
		Send_7219(0x07,0x1F);//	00011111
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x0F);//	00001111
		Send_7219(0x03,0x1F);// 00011111
		Send_7219(0x04,0x1F);//	00011111
		Send_7219(0x05,0x1F);//	00011111
		Send_7219(0x06,0x1F);//	00011111
		Send_7219(0x07,0x0F);//	00001111
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x07);//	00000111
		Send_7219(0x03,0x0F);// 00001111
		Send_7219(0x04,0x0F);//	00001111
		Send_7219(0x05,0x0F);//	00001111
		Send_7219(0x06,0x0F);//	00001111
		Send_7219(0x07,0x07);//	00000111
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x03);//	00000011
		Send_7219(0x03,0x07);// 00000111
		Send_7219(0x04,0x07);//	00000111
		Send_7219(0x05,0x07);//	00000111
		Send_7219(0x06,0x07);//	00000111
		Send_7219(0x07,0x03);//	00000011
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(1000);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x07);//	00000111
		Send_7219(0x03,0x0F);// 00001111
		Send_7219(0x04,0x0F);//	00001111
		Send_7219(0x05,0x0F);//	00001111
		Send_7219(0x06,0x0F);//	00001111
		Send_7219(0x07,0x07);//	00000111
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x0F);//	00001111
		Send_7219(0x03,0x1F);// 00011111
		Send_7219(0x04,0x1F);//	00011111
		Send_7219(0x05,0x1F);//	00011111
		Send_7219(0x06,0x1F);//	00011111
		Send_7219(0x07,0x0F);//	00001111
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x1F);//	00011111
		Send_7219(0x03,0x3F);// 00111111
		Send_7219(0x04,0x3F);//	00111111
		Send_7219(0x05,0x3F);//	00111111
		Send_7219(0x06,0x3F);//	00111111
		Send_7219(0x07,0x1F);//	00011111
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
		Send_7219(0x01,0x00);//	00000000
		Send_7219(0x02,0x3C);//	00111100
		Send_7219(0x03,0x7E);//	01111110
		Send_7219(0x04,0x7E);//	01111110
		Send_7219(0x05,0x7E);//	01111110
		Send_7219(0x06,0x7E);//	01111110
		Send_7219(0x07,0x3C);//	00111100
		Send_7219(0x08,0x00);//	00000000
		HAL_Delay(eye_speed);
}
void bite_eye(void)
{
	//While bite
	Send_7219(0x01,0x00);//	00000000
	Send_7219(0x02,0x00);//	00000000
	Send_7219(0x03,0x00);//	00000000
	Send_7219(0x04,0x00);//	00000000
	Send_7219(0x05,0x81);//	10000001
	Send_7219(0x06,0x42);//	01000010
	Send_7219(0x07,0x3C);//	00111100
	Send_7219(0x08,0x18);//	00011000
		HAL_Delay(eye_speed);
}
